snlkuharlocal/src/DataProcessors/ФормированиеБланкаДляДистрибьютера/ФормированиеБланкаДляДистрибьютера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеБланкаДляДистрибьютера</name>
  <attributes>
    <name>НеОтправлятьПисьмо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/РезервыТМЦ/РезервыТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ВиртуальныйРезерв</types>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыШК/ВидыШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыШК</name>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>Дополнительный</name>
  </enumValues>
  <enumValues>
    <name>Временный</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ЖизненныйЦиклНоменклатуры/ЖизненныйЦиклНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЖизненныйЦиклНоменклатуры</name>
  <enumValues>
    <name>Активна</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/УстановкаСкидокПоКонтрагентам/УстановкаСкидокПоКонтрагентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидокПоКонтрагентам</name>
  <registerRecords>InformationRegister.СкидкиНоменклатурыКонтрагентов</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <comment>Дата окончания действия прайса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Бренд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаКонечныйПокупатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ШтрихКоды/ШтрихКоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихКоды</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШК</name>
    <type>
      <types>EnumRef.ВидыШК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаМодификации</name>
    <type>
      <types>EnumRef.ПричиныКорректировкиШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтВКоробе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматШК</name>
    <type>
      <types>EnumRef.ФорматыШК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКодGS1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ФормированиеБланкаДляДистрибьютера/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	СформироватьОтчет(ТаблицаПараметров);
КонецПроцедуры

Процедура СформироватьОтчет(ТаблицаПараметров)
	
	Склады=новый Массив; 
	СписокПолучателей=новый СписокЗначений;
	СписокКоллекций=новый СписокЗначений;
	Рубль=Константы.ВалютаУпрУчета.Получить();
	СтрокаПараметров="";
	ИмяМакета="Макет";
	ТипЦен=Неопределено;
	ТипЦенДополнительный=Неопределено;
	Контрагент=Неопределено;
	ИмяФайла="";
	
	// Кухарь А.Ю.  23.11.2022 начало
	СписокРаспродажныхЦен=новый СписокЗначений; 
	// Кухарь А.Ю.  23.11.2022 конец
	
	
	Если ТаблицаПараметров <> Неопределено Тогда
		
		Для Каждого СтрокаТП ИЗ ТаблицаПараметров Цикл
			СтрокаПараметров=СтрокаПараметров+", Параметр: "+СтрокаТП.Имя+" - "+СтрокаТП.Значение; 
			Если СтрокаТП.Имя = "Склад" Тогда			
				Склады.Добавить(СтрокаТП.Значение);
			КонецЕсли;
			
			Если СтрокаТП.Имя = "ИмяМакета" Тогда			
				Макет= СтрокаТП.Значение;
			КонецЕсли;
			
			Если СтрокаТП.Имя = "Коллекция" Тогда			
				СписокКоллекций.Добавить(СтрокаТП.Значение);
			КонецЕсли;
			
			
			Если СтрокаТП.Имя = "Получатель" Тогда			
				СписокПолучателей.Добавить(СтрокаТП.Значение);
			КонецЕсли;
			
			Если СтрокаТП.Имя = "ТипЦен" Тогда			
				ТипЦен = СтрокаТП.Значение;
			КонецЕсли;
			
			
			Если СтрокаТП.Имя = "ТипЦенДополнительный" Тогда			
				ТипЦенДополнительный = СтрокаТП.Значение;
			КонецЕсли;
			
			Если СтрокаТП.Имя = "Контрагент" Тогда			
				Контрагент = СтрокаТП.Значение;
			КонецЕсли;
			
			Если СтрокаТП.Имя = "КаталогФотографий" Тогда			
				КаталогФотографий = СтрокаТП.Значение;
			КонецЕсли;
			
			Если СтрокаТП.Имя = "ЛокальныйКаталогФотографий" Тогда			
				ЛокальныйКаталогФотографий = СтрокаТП.Значение;
			КонецЕсли;
			
			Если СтрокаТП.Имя = "ИмяФайла" Тогда			
				ИмяФайла = СтрокаТП.Значение;
			КонецЕсли;

			// Кухарь А.Ю.  23.11.2022 начало
			Если СтрокаТП.Имя = "РаспродажныйТипЦены" Тогда			
				СписокРаспродажныхЦен.Добавить(СтрокаТП.Значение);
			КонецЕсли;
			// Кухарь А.Ю.  23.11.2022 конец
			
			
		КонецЦикла;
	КонецЕсли;
	
	ЗаписатьВЛог("Регламент",СтрокаПараметров,"Информация");
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет(ИмяМакета);
	
	ТЗ=ПолучитьТЗПоСпискуСкладовИКоллекций(СписокКоллекций,Склады, КаталогФотографий);		
	если Контрагент<>Неопределено тогда
		ТЗСкидок=ПолучитьСкидкуПоКонтрагентуЛокальная (Контрагент);
	КонецЕсли;
	
	ТабДок.Вывести(Макет.ПолучитьОбласть("Шапка|Основной"));
	
	// Кухарь А.Ю.  23.11.2022 начало
	Для каждого СтрСписка из СписокРаспродажныхЦен цикл
		ОбластьРаспродажныйТипЦен = Макет.ПолучитьОбласть("Шапка|РаспродажнаяЦена");
		ОбластьРаспродажныйТипЦен.Параметры.ТипЦены = СтрСписка.Значение;
		ТабДок.Присоединить(ОбластьРаспродажныйТипЦен);
	КонецЦикла;
	// Кухарь А.Ю.  23.11.2022 конец

	
	ОбластьШК = Макет.ПолучитьОбласть("Шапка|ШтрихКод");
	Для й =1 По 5 Цикл
		ОбластьШК.Параметры.ШтрихКодИмя = "ШтрихКод" + Строка(й);
		ТабДок.Присоединить(ОбластьШК);
	КонецЦикла;
	
	
	
	ОблСтрока = Макет.ПолучитьОбласть("Строка|Основной");
	ОблСтрокаШК = Макет.ПолучитьОбласть("Строка|ШтрихКод");
	
	МассивФайлов=НайтиФайлы(ЛокальныйКаталогФотографий,"*.jpg",ложь);	
	ТЗФайлов=новый ТаблицаЗначений;
	ТЗФайлов.Колонки.Добавить("ИмяФайла");
	ТЗФайлов.Колонки.Добавить("ИмяФайлаБезСуффикса");
	// Кухарь А.Ю.  12.12.2023 начало
	ТЗФайлов.Колонки.Добавить("Расширение");	 
	// Кухарь А.Ю.  12.12.2023 конец
	
	для каждого СтрМасс из МассивФайлов цикл
		СтрТЗ=ТЗФайлов.добавить();
		СтрТЗ.ИмяФайла=СтрМасс.имябезрасширения;
		СтрТЗ.ИмяФайлаБезСуффикса=Лев(СтрМасс.имябезрасширения,10);		
		// Кухарь А.Ю.  12.12.2023 начало
		СтрТЗ.расширение=СтрЗаменить(СтрМасс.Расширение,".",""); 
		// Кухарь А.Ю.  12.12.2023 конец
		
	КонецЦикла;
	
	// Кухарь А.Ю.  12.12.2023 начало
	МассивФайлов=НайтиФайлы(ЛокальныйКаталогФотографий,"*.png",ложь);	
	для каждого СтрМасс из МассивФайлов цикл
		СтрТЗ=ТЗФайлов.добавить();
		СтрТЗ.ИмяФайла=СтрМасс.имябезрасширения;
		СтрТЗ.ИмяФайлаБезСуффикса=Лев(СтрМасс.имябезрасширения,10);	
		// Кухарь А.Ю.  12.12.2023 начало
		СтрТЗ.расширение=СтрЗаменить(СтрМасс.Расширение,".",""); 
		// Кухарь А.Ю.  12.12.2023 конец
		
	КонецЦикла;	 
	// Кухарь А.Ю.  12.12.2023 конец
	
	
	
	
	Для каждого СтрТЗ из ТЗ Цикл
		#Если Клиент тогда
			ОбработкаПрерыванияПользователя();
		#КонецЕсли
		Скидка=0;
		ЗаполнитьЗначенияСвойств(ОблСтрока.Параметры,СтрТЗ);
		Если ЗначениеЗаполнено(ТипЦен) тогда
			ОблСтрока.Параметры.Цена=ПолучитьЦенуНоменклатуры(СтрТЗ.Модель,,ТипЦен,Рубль,1,ТекущаяДата());		
			// Кухарь А.Ю.  04.07.2022 начало
			//
			если Контрагент<>Неопределено и ЗначениеЗаполнено(ОблСтрока.Параметры.Цена) тогда

				// Кухарь А.Ю. 25.11.2022 начало
				//
				МассивСтрокСкидки=ТЗСкидок.НайтиСтроки(новый Структура("НоменклатураСкидки,ТипЦен",СтрТЗ.Модель,ТипЦен));
				если МассивСтрокСкидки.количество()=0 тогда
					МассивСтрокСкидки=ТЗСкидок.НайтиСтроки(новый Структура("Родитель,ТипЦен",СтрТЗ.Модель,ТипЦен));
				КонецЕсли;
				Для каждого СтрокаСкидки из МассивСтрокСкидки цикл
					Скидка=СтрокаСкидки.Скидка;
					ОблСтрока.Параметры.ЦенаСоСкидкой=ОблСтрока.Параметры.Цена-(ОблСтрока.Параметры.Цена*Скидка)/100;
					Прервать;
				КонецЦикла;
			 
				// Кухарь А.Ю. 25.11.2022 конец
				
			КонецЕсли;
			// Кухарь А.Ю.  04.07.2022 конец
			
		КонецЕсли;
		
		Если не ЗначениеЗаполнено(ОблСтрока.Параметры.Цена) и ЗначениеЗаполнено(ТипЦенДополнительный) тогда
			ОблСтрока.Параметры.Цена=ПолучитьЦенуНоменклатуры(СтрТЗ.Модель,,ТипЦен,ТипЦенДополнительный,1,ТекущаяДата());	
			// Кухарь А.Ю.  04.07.2022 начало
			//
			если Контрагент<>Неопределено и ЗначениеЗаполнено(ОблСтрока.Параметры.Цена) тогда
				МассивСтрокСкидки=ТЗСкидок.НайтиСтроки(новый Структура("Номенклатура,ТипЦен",СтрТЗ.Модель,ТипЦенДополнительный));
				Для каждого СтрокаСкидки из МассивСтрокСкидки цикл
					Скидка=СтрокаСкидки.Скидка;
					ОблСтрока.Параметры.ЦенаСоСкидкой=ОблСтрока.Параметры.Цена-(ОблСтрока.Параметры.Цена*Скидка)/100;
				Прервать;
				КонецЦикла;
			КонецЕсли;
			// Кухарь А.Ю.  04.07.2022 конец
			
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОблСтрока.Параметры.Цена) тогда
			Продолжить;	
		КонецЕсли;
		
		если Скидка=0 тогда
			ОблСтрока.Параметры.ЦенаСоСкидкой=ОблСтрока.Параметры.Цена;
		КонецЕсли;
		ОблСтрока.Параметры.Скидка=Скидка;

		если ЗначениеЗаполнено(СтрТЗ.Страна) тогда
			ОблСтрока.Параметры.ОписаниеТовара=ОблСтрока.Параметры.ОписаниеТовара+"  Производство "+СтрТЗ.Страна;
		КонецЕсли;
		ОблСтрока.Параметры.ОписаниеТовара=СокрЛП(СтрЗаменить(ОблСтрока.Параметры.ОписаниеТовара,Символы.ПС,""));
		
		СтрокаФоток="";
		СтрокаФотокУпаковки="";
		
		МассивСсылокНаФото=ТЗФайлов.НайтиСтроки(новый Структура("ИмяФайлаБезСуффикса",СтрТЗ.КодНоменклатуры)); 
		для каждого СтрокаМассива из МассивСсылокНаФото цикл
			// Кухарь А.Ю.  12.12.2023 начало
			// ПолнаяСсылка=КаталогФотографий+СтрокаМассива.ИмяФайла+".jpg";
			ПолнаяСсылка=КаталогФотографий+СтрокаМассива.ИмяФайла+"."+СтрокаМассива.Расширение;			 
			// Кухарь А.Ю.  12.12.2023 конец
			
			если Прав(СтрокаМассива.ИмяФайла,2)="_p" тогда
				СтрокаФотокУпаковки=ПолнаяСсылка;
			ИначеЕсли  Прав(СтрокаМассива.ИмяФайла,2)="_m" тогда
				СтрокаФоток=ПолнаяСсылка+", "+СтрокаФоток;
			иначе
				СтрокаФоток=СтрокаФоток+ПолнаяСсылка+", ";
			КонецЕсли;				
		КонецЦикла;
		СтрокаФоток=Сред(СтрокаФоток,1,СтрДлина(СтрокаФоток)-2);
		
		ОблСтрока.Параметры.Упаковка = СтрокаФотокУпаковки;   
		ОблСтрока.Параметры.СсылкаНаФото = СтрокаФоток;  
		// Кухарь А.Ю.  06.07.2022 конец
		
		ТабДок.Вывести(ОблСтрока);		
		
		// Кухарь А.Ю.  23.11.2022 начало
		ОблСтрокаЦенаРаспродажаная = Макет.ПолучитьОбласть("Строка|РаспродажнаяЦена");		
		Для каждого СтрЦеныРаспродажа из СписокРаспродажныхЦен цикл
			ОблСтрокаЦенаРаспродажаная.Параметры.РаспродажнаяЦена=ПолучитьЦенуНоменклатуры(СтрТЗ.Модель,,СтрЦеныРаспродажа.Значение,Рубль,1,ТекущаяДата());	
			
			если ОблСтрокаЦенаРаспродажаная.Параметры.РаспродажнаяЦена = Неопределено тогда
				ОблСтрокаЦенаРаспродажаная.Параметры.РаспродажнаяЦена=0;
			КонецЕсли;
			
			ТабДок.Присоединить(ОблСтрокаЦенаРаспродажаная);
		КонецЦикла;
		// Кухарь А.Ю.  23.11.2022 конец
		
		
		МассивШК = ПолучитьМассивШтрихКодов(СтрТЗ.Номенклатура);
		Для Каждого ШК Из МассивШК Цикл
			Если Найти(ШК, "999999") = 0 Тогда
				ОблСтрокаШК.Параметры.ШтрихКодНеОсновной = ШК;
				ТабДок.Присоединить(ОблСтрокаШК);
			КонецЕсли;
		КонецЦикла;
		
		
		
	КонецЦикла;
	
	Если НеОтправлятьПисьмо тогда
		ТабДок.Показать();
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(ИмяФайла) тогда
		ИмяФайла = "\\backup\report1c\ВыгрузкаТоваровЕЕЭ.xlsx";
	КонецЕсли;
	// Кухарь А.Ю.  22.11.2023 начало

//////////// ПЕРЕНЕСУ СЮДА СОЗДАНИЕ ФАЙЛА //////////////////////////////////////////////////	
	
	ТекОшибка = "Ошибка";
	
	СписокПолучателей = Новый СписокЗначений;
	СписокПолучателей.Добавить("kuhar@collant.ru");  
	СписокПолучателей.Добавить("mishura@collant.ru");
	
	Попытка
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
	Исключение
		ТекОшибка = ОписаниеОшибки();
		СформироватьВнутреннееУведомление(СписокПолучателей,"Всё плохо. "+ТекущаяДата()+" не записался файл "+ИмяФайла+" по причине "+ТекОшибка,"всё плохо!!!");
		Возврат;
	КонецПопытки;
	
//////////// НЕМНОЖКО ПЕРЕДЕЛАЮ И УБЕРУ ЛИШНИЙ КОД //////////////////////////////////////////	
	
	/// Шворобей ВЮ 21.12.2023 ++
	Попытка
		ОтправитьФайликВОблако(ИмяФайла);
	Исключение
		СформироватьВнутреннееУведомление(СписокПолучателей,"Всё плохо. "+ТекущаяДата()+" не отправился файл "+ИмяФайла+" в Облако по причине "+ОписаниеОшибки(),"всё плохо!!!");	
	КонецПопытки;
	/// Шворобей ВЮ 21.12.2023 ++
	
КонецПроцедуры

Функция ПолучитьТЗПоСпискуСкладовИКоллекций(СписокКоллекций,СписокСкладов, КаталогФотографий = "") Экспорт
	
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	Сводный.Номенклатура.Родитель.БрендДляСайта КАК Бренд,
	             |	Сводный.Номенклатура.Родитель КАК Модель,
	             |	Сводный.Номенклатура КАК Номенклатура,
	             |	ВЫБОР
	             |		КОГДА Сводный.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой < &ТекущаяДата и Сводный.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой<>&ПустаяДата
	             |			ТОГДА ИСТИНА
	             |		ИНАЧЕ ЛОЖЬ
	             |	КОНЕЦ КАК ТребуетсяМаркировка,	
	             |	Сводный.Номенклатура.Родитель.ТНВЭД.ДатаНачалаОбязательнойРаботыСМаркировкой КАК ДатаНачалаРаботыСМаркировкой,					 
				 |	Сводный.Номенклатура.Родитель.Код КАК КодНоменклатуры,
				 |	Сводный.Номенклатура.Родитель.ШтукВКоробочке КАК ШтукВКоробочке,
	             |	Сводный.СвободныйОстаток КАК СвободныйОстаток,
	             |	Сводный.Номенклатура.Родитель.КодПроизводителя КАК КодПроизводителя,
	             |	Сводный.Номенклатура.Наименование КАК Наименование,
	             |	Сводный.Номенклатура.Цвет КАК Цвет,
				 // Кухарь А.Ю. 28.08.2023 начало
				 //
				 |	Сводный.Номенклатура.ДопПараметрРазмера КАК ДопПараметрРазмера,
				 
				 // Кухарь А.Ю. 28.08.2023 конец				 
	             |	Сводный.Номенклатура.Размер КАК Размер,
	             |	Сводный.Номенклатура.Родитель.ОписаниеТовараДляСайта КАК ОписаниеТовара,
	             |	Сводный.Номенклатура.Родитель.Страна КАК Страна,
	             |	Сводный.Номенклатура.Родитель.Состав КАК Состав,
	             |	Сводный.Номенклатура.Родитель.ТипТовара КАК ТипТовара,
	             |	ШтрихКоды.Наименование КАК ШтрихКод,
	             |	""" + КаталогФотографий + """ + Сводный.Номенклатура.Родитель.Код + ""_m.jpg"" КАК СсылкаНаФото
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		ЕСТЬNULL(Остатки.Номенклатура, Резервы.Номенклатура) КАК Номенклатура,
	             |		ЕСТЬNULL(Остатки.КоличествоОстаток, 0) - ЕСТЬNULL(Резервы.КоличествоОстаток, 0) КАК СвободныйОстаток
	             |	ИЗ
	             |		РегистрНакопления.ОстаткиТМЦ.Остатки(
	             |				,
	             |				Склад В (&СписокСкладов)
	             |					И Номенклатура.Родитель.Коллекция В (&СписокКоллекций)) КАК Остатки
	             |			ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	             |					,
	             |					Склад В (&СписокСкладов)
	             |						И Номенклатура.Родитель.Коллекция В (&СписокКоллекций)) КАК Резервы
	             |			ПО Остатки.Номенклатура = Резервы.Номенклатура) КАК Сводный
	             |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ШтрихКоды КАК ШтрихКоды
	             |		ПО Сводный.Номенклатура = ШтрихКоды.Владелец
	             |			И (ШтрихКоды.ТипШК = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихКодов.Штука))
	             |			И (ШтрихКоды.ВидШК = ЗНАЧЕНИЕ(Перечисление.ВидыШК.Основной))
	             |ГДЕ
	             |	Сводный.СвободныйОстаток > 0
	             |	И Сводный.Номенклатура.ЖизненныйЦиклНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ЖизненныйЦиклНоменклатуры.Активна)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Сводный.Номенклатура,
	             |	Бренд";
	
	Запрос.УстановитьПараметр("СписокКоллекций",СписокКоллекций);
	Запрос.УстановитьПараметр("СписокСкладов",СписокСкладов);
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.УстановитьПараметр("ПустаяДата",ПустаяДата());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьСкидкуПоКонтрагентуЛокальная (Контрагент)
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	УстановкаСкидокПоКонтрагентамСкидки.ТипЦен КАК ТипЦен,
	             |	УстановкаСкидокПоКонтрагентамСкидки.Номенклатура КАК НоменклатураСкидки,
	             |	УстановкаСкидокПоКонтрагентамСкидки.Скидка КАК Скидка,
	             |	УстановкаСкидокПоКонтрагентам.Дата КАК Дата
	             |ПОМЕСТИТЬ ТЗСкидок
	             |ИЗ
	             |	Документ.УстановкаСкидокПоКонтрагентам.Скидки КАК УстановкаСкидокПоКонтрагентамСкидки
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УстановкаСкидокПоКонтрагентам КАК УстановкаСкидокПоКонтрагентам
	             |		ПО УстановкаСкидокПоКонтрагентамСкидки.Ссылка = УстановкаСкидокПоКонтрагентам.Ссылка
	             |ГДЕ
	             |	УстановкаСкидокПоКонтрагентам.Контрагенты.Контрагент = &Контрагент
	             |	И УстановкаСкидокПоКонтрагентам.Дата <= &Дата
	             |	И УстановкаСкидокПоКонтрагентам.Дата2 >= &Дата
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Спр.Ссылка.Родитель КАК Родитель,
	             |	ТЗСкидок.ТипЦен КАК ТипЦен,
	             |	ТЗСкидок.НоменклатураСкидки КАК НоменклатураСкидки,
	             |	ТЗСкидок.Скидка КАК Скидка,
	             |	ТЗСкидок.Дата КАК Дата
	             |ИЗ
	             |	ТЗСкидок КАК ТЗСкидок
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Спр
	             |		ПО (ТЗСкидок.НоменклатураСкидки = Спр.Ссылка.Родитель.Родитель.Родитель.Родитель.Родитель
	             |				ИЛИ ТЗСкидок.НоменклатураСкидки = Спр.Ссылка.Родитель.Родитель.Родитель.Родитель
	             |				ИЛИ ТЗСкидок.НоменклатураСкидки = Спр.Ссылка.Родитель.Родитель.Родитель
	             |				ИЛИ ТЗСкидок.НоменклатураСкидки = Спр.Ссылка.Родитель.Родитель)
	             |			И (НЕ Спр.Ссылка.ЭтоГруппа)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Дата УБЫВ";
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Запрос.УстановитьПараметр("Контрагент",Контрагент);

	возврат запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьМассивШтрихКодов(Знач Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихКоды.Наименование КАК ШтрихКод
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Владелец = &Номенклатура
	|	И ШтрихКоды.ВидШК <> ЗНАЧЕНИЕ(Перечисление.ВидыШК.Основной)
	|	И НЕ ШтрихКоды.ПометкаУдаления
	|";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ШтрихКод");
	
КонецФункции

Процедура ОтправитьФайликВОблако(ИмяФайла) Экспорт
	Если НЕ Пустаястрока(ИмяФайла) Тогда
		Результат = Обработки.ФормированиеБланкаДляДистрибьютера.ОтправитьВОблакоМейл(ИмяФайла, Неопределено);
	КонецЕсли;
КонецПроцедуры
